<?php
$corei9 = array(
    'id'=>'4',
    'name' => 'Intel Core i9',
    '# of cores' => '18',
    'Generation' =>  'Six',
    'Socket type' => 's1151',
    'Integrated GPU' => 'Intel UHD 630',
    'Warranty' => '3 years',
    'Price' => '19316',
    'Currency' => 'UAH',
    'Description' => 'Процессор INTEL Core™ i9 9900K (BX80684I99900K) с кодовым названием микроархитектуры 
                    Coffee Lake-S Refresh. Предназначен для настольной платформы Intel LGA 1151. Принадлежит к семейству 
                    высокопроизводительных процессоров Core i9.
                    Процессор INTEL Core™ i9 9900K производится по стандарту 14-нм техпроцесса, 
                    имеет 8 ядер, которые работают в 14 потоков со штатной тактовой частотой 3.6 ГГц, 5.0 ГГц в режиме Turbo Boost. 
                    Объем кэш-памяти 3 уровня равен 14 МБ. Имеет 2-х канальный контроллер памяти DDR4.'
);