<?php
$corei7 = array(
    'id'=>'3',
    'name' => 'Intel Core i7',
    '# of cores' => '4',
    'Generation' =>  'Seven',
    'Socket type' => 's1151',
    'Integrated GPU' => 'Intel UHD 630',
    'Warranty' => '3 years',
    'Price' => '19316',
    'Currency' => 'UAH',
    'Description' => 'Новый процессор Intel Core i7-7700 7-го поколения, с кодовым названием микроархитектуры Kaby Lake. 
                    Предназначен для настольной платформы Intel LGA 1151. Принадлежит к семейству высокопроизводительных процессоров Core i7.
                Intel Core i7-7700 производится по стандарту 14-нм техпроцесса, имеет 4 ядра, которые
                 работают в 8 потоков со штатной тактовой частотой 3.6 ГГц, 4.2 ГГц в режиме Turbo Boost. Объем кэш-памяти 
                 3 уровня равен 8 МБ. Имеет 2-х канальный контроллер памяти DDR4.
'
);